#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Plan `success`
#### Terraform Validation `success`


<details><summary>Show Plan</summary>

```

module.s3.aws_s3_bucket.s3_bucket: Refreshing state... [id=brunolabs1-module-s3-dev]
module.s3.aws_s3_bucket_server_side_encryption_configuration.s3_sse: Refreshing state... [id=brunolabs1-module-s3-dev]
module.s3.aws_s3_bucket_acl.s3_acl: Refreshing state... [id=brunolabs1-module-s3-dev,private]
module.s3.aws_s3_bucket_versioning.s3_versioning: Refreshing state... [id=brunolabs1-module-s3-dev]
module.s3.aws_s3_bucket_public_access_block.s3_block_access: Refreshing state... [id=brunolabs1-module-s3-dev]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.s3.aws_s3_bucket.s3_bucket must be replaced
-/+ resource "aws_s3_bucket" "s3_bucket" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      ~ arn                         = "arn:aws:s3:::brunolabs1-module-s3-dev" -> (known after apply)
      ~ bucket                      = "brunolabs1-module-s3-dev" -> "brunolabs-module-s3-dev" # forces replacement
      ~ bucket_domain_name          = "brunolabs1-module-s3-dev.s3.amazonaws.com" -> (known after apply)
      ~ bucket_regional_domain_name = "brunolabs1-module-s3-dev.s3.amazonaws.com" -> (known after apply)
      ~ hosted_zone_id              = "Z3AQBSTGFYJSTF" -> (known after apply)
      ~ id                          = "brunolabs1-module-s3-dev" -> (known after apply)
      ~ object_lock_enabled         = false -> (known after apply)
      + policy                      = (known after apply)
      ~ region                      = "us-east-1" -> (known after apply)
      ~ request_payer               = "BucketOwner" -> (known after apply)
        tags                        = {
            "bu"       = "bu-test"
            "team"     = "dev"
            "vertical" = "vertical-test"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
        # (2 unchanged attributes hidden)

      + cors_rule {
          + allowed_headers = (known after apply)
          + allowed_methods = (known after apply)
          + allowed_origins = (known after apply)
          + expose_headers  = (known after apply)
          + max_age_seconds = (known after apply)
        }

      - grant {
          - id          = "434d22d7cd6ceaa68fed219fd95384068a3d87f378278bbd4017d88a7197f093" -> null
          - permissions = [
              - "FULL_CONTROL",
            ] -> null
          - type        = "CanonicalUser" -> null
        }
      + grant {
          + id          = (known after apply)
          + permissions = (known after apply)
          + type        = (known after apply)
          + uri         = (known after apply)
        }

      + lifecycle_rule {
          + abort_incomplete_multipart_upload_days = (known after apply)
          + enabled                                = (known after apply)
          + id                                     = (known after apply)
          + prefix                                 = (known after apply)
          + tags                                   = (known after apply)

          + expiration {
              + date                         = (known after apply)
              + days                         = (known after apply)
              + expired_object_delete_marker = (known after apply)
            }

          + noncurrent_version_expiration {
              + days = (known after apply)
            }

          + noncurrent_version_transition {
              + days          = (known after apply)
              + storage_class = (known after apply)
            }

          + transition {
              + date          = (known after apply)
              + days          = (known after apply)
              + storage_class = (known after apply)
            }
        }

      + logging {
          + target_bucket = (known after apply)
          + target_prefix = (known after apply)
        }

      + object_lock_configuration {
          + object_lock_enabled = (known after apply)

          + rule {
              + default_retention {
                  + days  = (known after apply)
                  + mode  = (known after apply)
                  + years = (known after apply)
                }
            }
        }

      + replication_configuration {
          + role = (known after apply)

          + rules {
              + delete_marker_replication_status = (known after apply)
              + id                               = (known after apply)
              + prefix                           = (known after apply)
              + priority                         = (known after apply)
              + status                           = (known after apply)

              + destination {
                  + account_id         = (known after apply)
                  + bucket             = (known after apply)
                  + replica_kms_key_id = (known after apply)
                  + storage_class      = (known after apply)

                  + access_control_translation {
                      + owner = (known after apply)
                    }

                  + metrics {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }

                  + replication_time {
                      + minutes = (known after apply)
                      + status  = (known after apply)
                    }
                }

              + filter {
                  + prefix = (known after apply)
                  + tags   = (known after apply)
                }

              + source_selection_criteria {
                  + sse_kms_encrypted_objects {
                      + enabled = (known after apply)
                    }
                }
            }
        }

      ~ server_side_encryption_configuration {
          ~ rule {
              ~ bucket_key_enabled = false -> (known after apply)

              ~ apply_server_side_encryption_by_default {
                  + kms_master_key_id = (known after apply)
                  ~ sse_algorithm     = "AES256" -> (known after apply)
                }
            }
        }

      ~ versioning {
          ~ enabled    = true -> (known after apply)
          ~ mfa_delete = false -> (known after apply)
        }

      + website {
          + error_document           = (known after apply)
          + index_document           = (known after apply)
          + redirect_all_requests_to = (known after apply)
          + routing_rules            = (known after apply)
        }
    }

  # module.s3.aws_s3_bucket_acl.s3_acl must be replaced
-/+ resource "aws_s3_bucket_acl" "s3_acl" {
      ~ bucket = "brunolabs1-module-s3-dev" -> (known after apply) # forces replacement
      ~ id     = "brunolabs1-module-s3-dev,private" -> (known after apply)
        # (1 unchanged attribute hidden)

      ~ access_control_policy {
          - grant {
              - permission = "FULL_CONTROL" -> null

              - grantee {
                  - display_name = "brunopdossantos1993" -> null
                  - id           = "434d22d7cd6ceaa68fed219fd95384068a3d87f378278bbd4017d88a7197f093" -> null
                  - type         = "CanonicalUser" -> null
                }
            }
          + grant {
              + permission = (known after apply)

              + grantee {
                  + display_name  = (known after apply)
                  + email_address = (known after apply)
                  + id            = (known after apply)
                  + type          = (known after apply)
                  + uri           = (known after apply)
                }
            }

          ~ owner {
              ~ display_name = "brunopdossantos1993" -> (known after apply)
              ~ id           = "434d22d7cd6ceaa68fed219fd95384068a3d87f378278bbd4017d88a7197f093" -> (known after apply)
            }
        }
    }

  # module.s3.aws_s3_bucket_public_access_block.s3_block_access must be replaced
-/+ resource "aws_s3_bucket_public_access_block" "s3_block_access" {
      ~ bucket                  = "brunolabs1-module-s3-dev" -> (known after apply) # forces replacement
      ~ id                      = "brunolabs1-module-s3-dev" -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.s3.aws_s3_bucket_server_side_encryption_configuration.s3_sse must be replaced
-/+ resource "aws_s3_bucket_server_side_encryption_configuration" "s3_sse" {
      ~ bucket = "brunolabs1-module-s3-dev" -> "brunolabs-module-s3-dev" # forces replacement
      ~ id     = "brunolabs1-module-s3-dev" -> (known after apply)

      - rule {
          - bucket_key_enabled = false -> null

          - apply_server_side_encryption_by_default {
              - sse_algorithm = "AES256" -> null
            }
        }
      + rule {
          + apply_server_side_encryption_by_default {
              + sse_algorithm = "AES256"
            }
        }
    }

  # module.s3.aws_s3_bucket_versioning.s3_versioning must be replaced
-/+ resource "aws_s3_bucket_versioning" "s3_versioning" {
      ~ bucket = "brunolabs1-module-s3-dev" -> (known after apply) # forces replacement
      ~ id     = "brunolabs1-module-s3-dev" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 5 to add, 0 to change, 5 to destroy.

Changes to Outputs:
  ~ arn         = "arn:aws:s3:::brunolabs1-module-s3-dev" -> (known after apply)
  ~ domain_name = "brunolabs1-module-s3-dev.s3.amazonaws.com" -> (known after apply)
  ~ id          = "brunolabs1-module-s3-dev" -> (known after apply)
  ~ region      = "us-east-1" -> (known after apply)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
*Pushed by: @brunopsantos93, Action: `pull_request`*